Catalogs/упНазначенияДатчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упНазначенияДатчиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дискретный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Непрерывный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упНазначенияДатчиков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение справочника	
//
// Параметры:
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Элемент = Справочники.упНазначенияДатчиков.Топливо.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Пробег.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ТревожнаяКнопка.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Зажигание.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ДвигательЗаведен.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ЗначениеСкорости.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Одометр.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПервоначальноеЗаполнение()

#КонецОбласти 

#КонецЕсли
